app/controllers/boards_controller.rb

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (board_id = 'params[:id]')
---
  def show
    @board = Board.find_by(id: params[:id])
    @posts = Post.where("board_id = '#{params[:id]}'")