app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.board_id = Board.find_by(id: params[:board_id]).id
    if @post.save
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "posts" ("title", "body", "opt_image_url", "user_id", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "board"], ["body", "id "], ["opt_image_url", "test"], ["user_id", 3], ["board_id", 1], ["created_at", "2015-11-08 17:35:31.898246"], ["updated_at", "2015-11-08 17:35:31.898246"]]