app/controllers/replies_controller.rb

  def create
    @reply = Reply.new(reply_params)
    @reply.user_id = current_user.id
    @reply.post_id = Post.find_by(id: params[:post_id]).id
    if @reply.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 7]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "replies" ("text", "opt_image_url", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text", "dfsasdads"], ["opt_image_url", "dsafdds"], ["user_id", 3], ["post_id", 7], ["created_at", "2015-11-08 21:53:40.883289"], ["updated_at", "2015-11-08 21:53:40.883289"]]