app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find(current_user.id)
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = $1, "image_url" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "bab"], ["image_url", ""], ["updated_at", "2015-11-06 21:54:08.569788"], ["id", 1]]

  def destroy
    @user = User.find(params[:id])
    redirect_to('/logout')
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]